# SQL- Data definiton Language (DDL)
Tabellen erstellen und die Struktur ändern wie z.B : Attribute ändern/löschen/neu ... 

#### Befehle 
- CREATE TABLE
- ALTER TABLE
- DROP TABLE

#### Datentypen 
Siehe ERM skript Nummer 39

In [11]:
import sqlite3
import pandas as pd
conn = sqlite3.connect(":memory:")
cur = conn.cursor()

cur.execute("""
CREATE TABLE schueler(
            schuelerID INTEGER PRIMARY KEY,
            name VARCHAR(50) NOT NULL,
            "alter" INTEGER NOT NULL);
            """)

comand = "PRAGMA TABLE_INFO('schueler');"

print(cur.execute(comand).fetchall())

pd.read_sql(comand, conn)

cur.execute("""ALTER TABLE schueler
            ADD klasse VARCHAR(10) NOT NULL;
            """)

pd.read_sql(comand, conn)

cur.execute("""DROP TABLE schueler;""")


pd.read_sql(comand, conn)

[(0, 'schuelerID', 'INTEGER', 0, None, 1), (1, 'name', 'VARCHAR(50)', 1, None, 0), (2, 'alter', 'INTEGER', 1, None, 0)]

Empty DataFrame
Columns: [cid, name, type, notnull, dflt_value, pk]
Index: []